areas = [  # для img24 - img67
    (500, 500, 800, 1100),  # корзинка для столовых приборов
    (1320, 250, 1750, 700),  # салат
    (1800, 100, 2500, 830),  # ребрышки
    (1380, 830, 1700, 1200),  # левая чашка
    (1700, 830, 2100, 1200),  # правая чашка
    (2300, 780, 2900, 1230),  # чайник
    (1100, 1280, 1700, 1950),  # цезарь
    (1650, 1280, 2500, 2100),  # рыба
    (750, 1400, 1100, 1750),  # суп
    (820, 200, 1350, 1000)  # борщ
]
areas_fragment = []
for (x1, y1, x2, y2) in areas:
    areas_fragment.append([
        (x1, y1, (x1 + x2) // 2, y2), ((x1 + x2) // 2, y1, x2, y2),
        (x1, y1, x2, (y1 + y2) // 2), (x1, (y1 + y2) // 2, x2, y2),
    ])

print(areas_fragment)
